feat: update with mermaid diagrams
Signed-off-by: bupd <bupdprasanth@gmail.com>
